src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <attributes>
    <name>ТипОрганизации</name>
    <type>
      <types>EnumRef.ТипыОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ТипыОрганизаций/ТипыОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОрганизаций</name>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныйПредприниматель</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Организации/Forms/ФормаЭлемента/Module.bsl
// Форма элемента справочника "Организации".
// Управляет видимостью реквизита "ГлавныйБухгалтер" в зависимости от типа организации.
// Поле с главным бухгалтером показывается только для юридических лиц.

#Область ОбработчикиСобытийФормы

// Обработчик открытия формы.
// При открытии настраиваем видимость согласно текущему типу организации.
&НаКлиенте
Процедура ПриОткрытии(Отказ)
    УстановитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Обработчик изменения реквизита "ТипОрганизации".
// При переключении типа (Юр. лицо / ИП) обновляем видимость главного бухгалтера.
&НаКлиенте
Процедура ТипОрганизацииПриИзменении(Элемент)
    УстановитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Устанавливает видимость поля "ГлавныйБухгалтер".
// Если организация является юридическим лицом – поле отображается,
// для всех остальных типов (включая индивидуальных предпринимателей и пустое значение) – скрывается.
&НаКлиенте
Процедура УстановитьВидимость()
    Если Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо") Тогда  
        Элементы.ГлавныйБухгалтер.Видимость = Истина;
    Иначе   
        Элементы.ГлавныйБухгалтер.Видимость = Ложь;
    КонецЕсли;
КонецПроцедуры

#КонецОбласти
